In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
from pyspark.sql.types import *
import os

In [2]:
spark = SparkSession.builder.appName("Basics").master("local[*]").getOrCreate()

WARNING: Using incubator modules: jdk.incubator.vector
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
26/02/14 15:55:49 WARN Utils: Your hostname, LAPTOP-A2FP9AQK, resolves to a loopback address: 127.0.1.1; using 10.255.255.254 instead (on interface lo)
26/02/14 15:55:49 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
26/02/14 15:55:50 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
data=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17),
(15 ,'Mohit',45000,  18),
(13 ,'Nidhi',60000,  17),      
(14 ,'Priya',90000,  18),  
(18 ,'Sam',65000,   17)
     ]

In [4]:
schema =['id','name','salary','manager_id']

In [5]:
df = spark.createDataFrame(data,schema)

In [6]:
df.show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 10|  Anil| 50000|        18|
| 11| Vikas| 75000|        16|
| 12| Nisha| 40000|        18|
| 13| Nidhi| 60000|        17|
| 14| Priya| 80000|        18|
| 15| Mohit| 45000|        18|
| 16|Rajesh| 90000|        10|
| 17| Raman| 55000|        16|
| 18|   Sam| 65000|        17|
| 15| Mohit| 45000|        18|
| 13| Nidhi| 60000|        17|
| 14| Priya| 90000|        18|
| 18|   Sam| 65000|        17|
+---+------+------+----------+

In [8]:
df1 = df.distinct()
df1.show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 10|  Anil| 50000|        18|
| 11| Vikas| 75000|        16|
| 12| Nisha| 40000|        18|
| 13| Nidhi| 60000|        17|
| 14| Priya| 80000|        18|
| 15| Mohit| 45000|        18|
| 16|Rajesh| 90000|        10|
| 17| Raman| 55000|        16|
| 18|   Sam| 65000|        17|
| 14| Priya| 90000|        18|
+---+------+------+----------+

In [9]:
df.count()

13

In [10]:
df1.count()

10

In [13]:
df.select("id","name","salary","manager_id").distinct().show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 10|  Anil| 50000|        18|
| 11| Vikas| 75000|        16|
| 12| Nisha| 40000|        18|
| 13| Nidhi| 60000|        17|
| 14| Priya| 80000|        18|
| 15| Mohit| 45000|        18|
| 16|Rajesh| 90000|        10|
| 17| Raman| 55000|        16|
| 18|   Sam| 65000|        17|
| 14| Priya| 90000|        18|
+---+------+------+----------+

In [14]:
df2 = df.drop_duplicates(["id","name","salary","manager_id"])
df2.show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 10|  Anil| 50000|        18|
| 11| Vikas| 75000|        16|
| 12| Nisha| 40000|        18|
| 13| Nidhi| 60000|        17|
| 14| Priya| 80000|        18|
| 15| Mohit| 45000|        18|
| 16|Rajesh| 90000|        10|
| 17| Raman| 55000|        16|
| 18|   Sam| 65000|        17|
| 14| Priya| 90000|        18|
+---+------+------+----------+

In [15]:
df2.count()

10

In [18]:
df2.sort("salary").show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 12| Nisha| 40000|        18|
| 15| Mohit| 45000|        18|
| 10|  Anil| 50000|        18|
| 17| Raman| 55000|        16|
| 13| Nidhi| 60000|        17|
| 18|   Sam| 65000|        17|
| 11| Vikas| 75000|        16|
| 14| Priya| 80000|        18|
| 16|Rajesh| 90000|        10|
| 14| Priya| 90000|        18|
+---+------+------+----------+

In [19]:
df2.sort(col("salary").desc()).show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 16|Rajesh| 90000|        10|
| 14| Priya| 90000|        18|
| 14| Priya| 80000|        18|
| 11| Vikas| 75000|        16|
| 18|   Sam| 65000|        17|
| 13| Nidhi| 60000|        17|
| 17| Raman| 55000|        16|
| 10|  Anil| 50000|        18|
| 15| Mohit| 45000|        18|
| 12| Nisha| 40000|        18|
+---+------+------+----------+

In [20]:
df2.sort(col("salary").desc(),col("name").desc()).show()

+---+------+------+----------+
| id|  name|salary|manager_id|
+---+------+------+----------+
| 16|Rajesh| 90000|        10|
| 14| Priya| 90000|        18|
| 14| Priya| 80000|        18|
| 11| Vikas| 75000|        16|
| 18|   Sam| 65000|        17|
| 13| Nidhi| 60000|        17|
| 17| Raman| 55000|        16|
| 10|  Anil| 50000|        18|
| 15| Mohit| 45000|        18|
| 12| Nisha| 40000|        18|
+---+------+------+----------+

In [21]:
df2.select(sum("salary"),max("salary"),min("salary")).show()

+-----------+-----------+-----------+
|sum(salary)|max(salary)|min(salary)|
+-----------+-----------+-----------+
|     650000|      90000|      40000|
+-----------+-----------+-----------+

In [24]:
df.groupBy("manager_id")\
    .agg(sum("salary").alias("total_salary")).show()

+----------+------------+
|manager_id|total_salary|
+----------+------------+
|        18|      350000|
|        16|      130000|
|        17|      250000|
|        10|       90000|
+----------+------------+

In [25]:
spark.stop()